<?php

return [
    0 => '无记录',
    1 => '主题锁帖',
    2 => '主题解锁',
    3 => '主题转私密',
    4 => '主题转公开',
    15 => '主题改边限',
    16 => '主题改非边限',
    21 => '主题禁止回复',
    22 => '主题允许回复',
    40 => '主题上浮',
    41 => '主题下沉',
    42 => '主题推荐',
    43 => '主题推荐撤销',
    44 => '主题精华',
    45 => '主题精华撤销',
    46 => '主题置顶',
    47 => '主题置顶撤销',
    60 => '隐+锁+禁7+清（隐藏和锁定主题，用户禁言7天，等级清零）',//恶意发无意义书籍意图升级
    9 => '主题转移板块',
    5 => '主题删除',
    6 => '主题恢复',
    111 => '将全楼书评标记为当前编推', //全楼改为当前编推
    112 => '将全楼书评标记为往期编推', //全楼改为往期编推
    113 => '将全楼书评标记为专题推荐', //全楼改为专题推荐
    114 => '将全楼书评标记为非编推', //全楼改为非编推
    121 => '将本文标记为当前编推', //单项改为当前编推
    122 => '将本文标记为往期编推', //单项改为往期编推
    123 => '将本文标记为专题推荐', //单项改为专题推荐
    124 => '将本文标记为非编推', //单项改为非编推

    10 => '回帖修改马甲',
    37 => '回帖转边缘',//?
    38 => '回帖转非边缘',//?
    11 => '回帖折叠',
    12 => '回帖解折',
    72 => '折+扣（回帖折叠，扣除一定虚拟物）',//管理员不愿意回复
    32 => '回帖折+禁1（回帖折叠，发帖人禁言+一天）',//?车轱辘,版务区水贴，作者楼里水贴
    39 => '回帖折+禁3（回帖折叠，发帖人禁言+3天）',//?车轱辘,版务区水贴，作者楼里水贴
    30 => '回帖折+禁1+清（回帖折叠，发帖人禁言+1天，积分等级清零）',//这个基本上无效了
    71 => '回帖折+禁7+清（回帖折叠，发帖人禁言+7天，积分等级清零）',//攻击性不友善
    34 => '回帖折+清+封1（回帖折叠，等级清零，发言人禁止登陆1天）',//？特么特别驴叫不改的违禁
    35 => '回帖删+清+封7（回帖删除，等级清零，发言人禁止登陆7天）',//？普通辱骂
    36 => '回帖删+封（回帖删除，等级清零，发言人永久禁止登陆）',//？特别厉害的辱骂
    101 => '将本楼评价标记为当前编推', //单项改为当前编推
    102 => '将本楼评价标记为往期编推', //单项改为往期编推
    103 => '将本楼评价标记为专题推荐', //单项改为专题推荐
    104 => '将本楼评价标记为非编推', //单项改为非编推
    7 => '回帖删除',
    75 => '回帖类型修改', //单项改为“回帖/点评/作业正文/作业批评/问题/回答”等

    13 => '用户禁言',
    14 => '用户解禁言',
    18 => '用户禁止登陆',
    19 => '用户允许登陆',
    20 => '用户等级清零',
    50 => '用户分值管理', //增加减少盐粒，咸鱼，火腿，等级，邀请额度
    52 => '账户保护性锁定1天并重置密码',
    53 => '账户封禁1000天并重置密码',
    55 => '赠送头衔',
    57 => '赠送作业活动邀请券',
    58 => '用户禁止使用作业区',
    59 => '用户解禁作业区',

    61 => '动态转私密',
    62 => '动态转公开',
    63 => '动态私+禁3（动态转私密，发帖人禁言+3天）',//边限动态
    64 => '动态私+禁7+清（动态转私密，发帖人禁言+7天，积分等级清零）',//多次比较严重的边限/违规动态
    65 => '动态删+清+封1（动态删除，积分等级清零，发言人禁止登陆1天）',//违反商业性规定/恋童
    66 => '动态删+封（动态删除，发言人永久禁止登陆）',//恶意广告
    17 => '动态删除',

    31 => '点评套餐：禁言、折叠、积分清零',// 已失效
    8 => '删除点评',
];
