<?php

return [
    1 => [
        'title' => '热心咸鱼',
        'description' => '感谢你的支持！这里的水好像能变得更清一点了呢！在废文网输入你的Patreon邮箱，你将出现在我们的月度感谢名单上!',
        'amount' => 1,
        'style' => 0,
        'rewards' => [
            1 => '月度感谢名单',
        ],
    ],
    2 => [
        'title' => '初级赞助者',
        'description' => '感谢你的支持！水域更清澈了！在废文网输入你的Patreon邮箱，你会得到当月头衔“初级赞助者”，获得当月免广告权限，并出现在我们的月度感谢名单上!',
        'amount' => 5,
        'style' => 0,
        'rewards' => [
            1 => '月度感谢名单',
            2 => '当月头衔“初级赞助者”',
            3 => '当月免广告',
            4 => '自定义站内捐助身份显示',
        ],
    ],
    3 => [
        'title' => '中级赞助者',
        'description' => '感谢你的支持！水域生机勃勃！在废文网输入你的Patreon邮箱，你会得到当月头衔“中级赞助者”，获得永久免广告权限和每月一次的补签资格，并在月度感谢名单上更加显目!',
        'amount' => 30,
        'style' =>111,
        'rewards' => [
            1 => '显目的月度感谢名单',
            2 => '当月头衔“中级赞助者”',
            3 => '每月一次补签资格（自用）',
            4 => '永久免广告',
            5 => '自定义站内捐助身份显示',
        ],
    ],
    4 => [
        'title' => '高级赞助者',
        'description' => '感谢你的支持！在废文网输入你的Patreon邮箱，你会得到永久头衔“高级赞助者”，获得每月5个（可以转赠）永久免广告资格和每月5次（可以转赠）的补签资格，并在月度感谢名单上相当惹眼！你还可以加入我们的核心粉丝群，与运营人员交流!',
        'amount' => 100,
        'style' =>112,
        'rewards' => [
            1 => '惹眼的感谢名单',
            2 => '核心粉丝群入群资格',
            3 => '永久头衔“高级赞助者”',
            4 => '每月5个补签卡资格（可转赠别人）',
            5 => '每月5个永久去广告资格（可转赠别人）',
            6 => '自定义站内捐助身份显示和捐助感言',
        ],
    ],
    5 => [
        'title' => '顶级赞助者',
        'description' => '感谢你的支持！除了顶级的头衔、首席名单、数量众多的补签卡和免广告资格及入群资格以外，你每月还有一次特殊权利——告诉我们你最喜欢的本站作者与你想知道的问题，我们将对该作者进行专门采访，采访内容将在废文网与微博平台进行推送!',
        'amount' => 300,
        'style' => 113,
        'rewards' => [
            1 => '首席感谢名单',
            2 => '核心粉丝群入群资格',
            3 => '作者采访提问提名权利',
            4 => '永久头衔“顶级赞助者”',
            5 => '每月20个补签卡资格（可转赠别人）',
            6 => '每月20个永久去广告资格（可转赠别人）',
            7 => '自定义站内捐助身份显示和独立捐助感言展示',
        ],
    ],
];
