<?php
// Frontend config copy: /frontend/src/config/constant.ts  FAQTypes
// please update both frontend and backend configs
return [
    1 => [
        'title' => '基本问题/账户问题',
        'children' => [
            1 => '打不开、进不去、报错了',
            2 => '邀请码/邀请链接',
            3 => '邮箱错误、重置密码、更改邮箱',
            4 => '用户名修改、用户名登陆',
            5 => 'APP？',
        ],
    ],
    2 => [
        'title' => '个人使用',
        'children' => [
            1 => '签到、答题',
            2 => '等级',
            3 => '关联账户',
            4 => '虚拟物（盐粒、咸鱼、火腿）',
            5 => '个人简介',
        ],
    ],

    3 => [
        'title' => '看文',
        'children' => [
            1 => '首页、目录、排序',
            2 => '筛选、搜索',
            3 => '标签',
            4 => '编推',
            5 => '收藏、收藏夹',
            6 => '清单',
            7 => '书签、历史、版面美化'
        ],
    ],
    4 => [
        'title' => '发文发帖',
        'children' => [
            1 => '发文发帖',
            2 => '边限设置',
            3 => '隐藏、禁止回复',
            5 => '评论',
            6 => '格式',
            7 => '恢复数据',
            8 => '删帖、删文'
        ],
    ],
    5 => [
        'title' => '论坛交互',
        'children' => [
            1 => '提醒、私信、问题箱',
            2 => '打赏、评票',
            3 => '粉丝、关注、动态', //原5-4转移
            4 => '题头',
            5 => '作业活动',
        ],
    ],
    6 => [
        'title' => '站务相关',
        'children' => [
            1 => '当前版规',
            2 => '违规处理',
            3 => '举报',
            4 => '仲裁',
            5 => '当前站内活动',
            6 => '其他快捷入口',
        ],
    ],
    7 => [
        'title' => '社区建设',
        'children' => [
            1 => 'bug反馈',
            2 => '建议意见',
            3 => '社区未来',
            4 => '加入废文',
            5 => '商业化/经济支持',
        ],
    ],
];
