<div class="">
    <a type="button" data-toggle="collapse" data-target="#registration_by_email_steps" style="cursor: pointer;" class="font-1">
        点击查看《通过邮箱申请注册邀请链接的详细步骤》
    </a>
    &nbsp;&nbsp;<a href="{{route('search', ['search'=>'邀请链接'])}}" class="">>>更多详情搜索帮助“邀请链接”</a>
    <div class="collapse indentation main-text font-6 grayout" id="registration_by_email_steps">
        <h5>一直以来，废文网致力于维护一片自由的读写环境，我们尊重每一篇充满诚意的作品，欢迎每一位志同道合的文学爱好者加入，但是为了规避恶意攻击、保护网站，我们将对用户进行一定程度的资质审核。</h5>
        <h4>【审核流程】</h4>
        <div class="font-6">
            【步骤1】提交申请注册邮箱 <br>
            【步骤2】回答注册测试题<br>
            【步骤3】验证注册邮箱<br>
            【步骤4】完成注册邀请问卷 <br>
            【步骤5】进入审核队列，耐心等待审核，期间可以从【步骤1】输入邮箱查询当前申请进度 <br>
            【步骤6】（审核通过后）将从之前提交的申请注册邮箱，收到一封含有邀请链接的邮件。没有收到邮件的，可以从【步骤1】输入邮箱查询邮件发送时间，并重发邀请邮件 <br>
            【步骤7】将连接复制到浏览器打开，按照提示进行注册 <br>
        </div>
        <h4>【注意事项】</h4>
        <div class="font-6">
            <h6 class="warning-tag">功能【测试中】，随时更新，申请时请仔细阅读当前说明</h6>
            1.&nbsp;通过参加活动等途径获得邀请连接的，无需等待审核，将直接进入【步骤6】。<br>
            2.&nbsp;请认真完成问卷的每一项内容，不抄袭，不敷衍<br>
            3.&nbsp;邀请链接将直接发至指定邮箱，邮箱无法修改。因此，请确保你所提交的邮箱：格式无误，未注册过，属于本人，能正常使用，未曾参与过盗号及账户买卖。请不要使用QQ邮箱。<br>
            4.&nbsp;页面含有防批量注册机制，请【不要】刷新，【不要】使用浏览器“返回”前页面，【不要】开启多个页面进行申请。想要继续完成之前未完成的申请，请只从<a href="{{route('register.by_invitation_email.submit_email_form')}}">《通过邮箱注册页面》</a>输入邮箱继续。<br>
            4.&nbsp;在等待期间，可以从<a href="{{route('register.by_invitation_email.submit_email_form')}}">《通过邮箱注册页面》</a>输入邮箱，查询审核/排队进度（每5分钟只能查询一次）。正常查询不属于“重复申请”，只有使用多个邮箱分别完成全部申请，或一份答案的选段出现在多份申请里，才属于“重复申请”，将直接进入黑名单。<br>
            5.&nbsp;收到链接后，请将链接粘贴到合适的浏览器打开。使用已屏蔽本网站的浏览器将无法打开页面，如QQ浏览器、QQ/TIM/微信内置浏览器。<br>
            6.&nbsp;因当前申请人数众多，审核流程较长（7日左右），每日通过人工审核人数有限，请做好等待的准备，勿催促审核进程。如果介意，请选择其他注册方式。<br>
            7.&nbsp;因当前申请人数众多，而站内每日通过邀请的名额有限，无法通过全部的申请。如果申请中含有以下情况，将不会通过申请：抄袭，直接复制粘贴来自网络的资源或注册页的说明凑字数，语句极不通顺，标点符号极不规范，回答有拼凑痕迹前后矛盾，同样的回答反复出现（重复注册或剽窃他人回答），回答和题干问题不一致（未仔细审题），回答不符合网站定位。其中，抄袭、敷衍、重复申请的，将直接进入<code>黑名单</code>。其他情况的不合格申请，可以重新提交。<br>
            8.&nbsp;其他常见问题可以&nbsp;<a href="{{route('search', ['search'=>'邀请链接'])}}" class=""><code>《搜索帮助“邀请链接”》</code></a>&nbsp;获取答案，实时更新。
        </div>

    </div>
</div>
